Executing CWB script file cws/basic.2.cws, directing output to cws/results/basic.2.out.
July 25, 1996   13:37
Execution time (user,system,gc,real):(0.001,0.004,0.000,0.013)
cwb-nc> load basic.pccs
Execution time (user,system,gc,real):(0.034,0.007,0.000,0.041)
cwb-nc> 
cwb-nc> load formulas/failures_responded.mu
Execution time (user,system,gc,real):(0.007,0.000,0.000,0.008)
cwb-nc> load formulas/can_tick.mu
Execution time (user,system,gc,real):(0.002,0.000,0.000,0.003)
cwb-nc> load formulas/failures_possible.mu
Execution time (user,system,gc,real):(0.002,0.000,0.000,0.003)
cwb-nc> load formulas/no_false_alarms.mu
Execution time (user,system,gc,real):(0.003,0.000,0.000,0.003)
cwb-nc> load formulas/eventually_silent.mu
Execution time (user,system,gc,real):(0.008,0.000,0.000,0.008)
cwb-nc> 
cwb-nc> min -S bisim SS SS-min
Building automaton...
...
States: 312
Transitions: 801
Done building automaton.
Minimizing automaton...
Computing bisimulation...
Done computing bisimulation.
Done minimizing automaton.
Execution time (user,system,gc,real):(1.602,0.044,0.077,1.661)
cwb-nc> 
cwb-nc> chk SS-min failures_responded
Invoking L2 model checker.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(1.571,0.069,0.189,1.651)
cwb-nc> chk SS-min can_tick
Invoking alternation-free model checker.
Building automaton...
..
States: 287
Transitions: 713
Done building automaton.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(0.243,0.024,0.084,0.362)
cwb-nc> chk SS-min failures_possible
Invoking alternation-free model checker.
Building automaton...
..
States: 287
Transitions: 713
Done building automaton.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(0.147,0.005,0.000,0.153)
cwb-nc> chk SS-min no_false_alarms
Invoking alternation-free model checker.
Building automaton...
..
States: 287
Transitions: 713
Done building automaton.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(0.258,0.027,0.088,0.447)
cwb-nc> chk SS-min eventually_silent
Invoking L2 model checker.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(1.670,0.054,0.234,1.742)
cwb-nc> 
cwb-nc> 