Executing CWB script file cws/basic.1.cws, directing output to cws/results/basic.1.out.
July 25, 1996   13:36
Execution time (user,system,gc,real):(0.001,0.007,0.000,0.122)
cwb-nc> load basic.pccs
Execution time (user,system,gc,real):(0.038,0.009,0.000,0.121)
cwb-nc> 
cwb-nc> load formulas/failures_responded.mu
Execution time (user,system,gc,real):(0.008,0.003,0.000,0.126)
cwb-nc> load formulas/can_tick.mu
Execution time (user,system,gc,real):(0.002,0.002,0.000,0.026)
cwb-nc> load formulas/failures_possible.mu
Execution time (user,system,gc,real):(0.003,0.002,0.000,0.029)
cwb-nc> load formulas/no_false_alarms.mu
Execution time (user,system,gc,real):(0.003,0.002,0.000,0.043)
cwb-nc> load formulas/eventually_silent.mu
Execution time (user,system,gc,real):(0.009,0.002,0.000,0.028)
cwb-nc> 
cwb-nc> chk SS failures_responded
Invoking L2 model checker.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(3.739,0.072,0.195,3.896)
cwb-nc> chk SS can_tick
Invoking alternation-free model checker.
Building automaton...
...
States: 312
Transitions: 801
Done building automaton.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(0.470,0.007,0.014,0.482)
cwb-nc> chk SS failures_possible
Invoking alternation-free model checker.
Building automaton...
...
States: 312
Transitions: 801
Done building automaton.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(0.462,0.027,0.080,0.633)
cwb-nc> chk SS no_false_alarms
Invoking alternation-free model checker.
Building automaton...
...
States: 312
Transitions: 801
Done building automaton.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(0.405,0.005,0.000,0.415)
cwb-nc> chk SS eventually_silent
Invoking L2 model checker.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(3.104,0.045,0.182,3.174)
cwb-nc> 
cwb-nc> 