Executing CWB script file cws/bruns.1.cws, directing output to cws/results/bruns.1.out.
July 25, 1996   13:37
Execution time (user,system,gc,real):(0.001,0.004,0.000,0.014)
cwb-nc> load bruns.pccs
Execution time (user,system,gc,real):(0.030,0.008,0.000,0.078)
cwb-nc> 
cwb-nc> load formulas/failures_responded.mu
Execution time (user,system,gc,real):(0.007,0.000,0.000,0.007)
cwb-nc> load formulas/can_tick.mu
Execution time (user,system,gc,real):(0.002,0.000,0.000,0.003)
cwb-nc> load formulas/failures_possible.mu
Execution time (user,system,gc,real):(0.002,0.000,0.000,0.002)
cwb-nc> load formulas/no_false_alarms.mu
Execution time (user,system,gc,real):(0.003,0.000,0.000,0.004)
cwb-nc> load formulas/eventually_silent.mu
Execution time (user,system,gc,real):(0.007,0.000,0.000,0.008)
cwb-nc> 
cwb-nc> chk SS failures_responded
Invoking L2 model checker.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(11.324,0.271,1.152,12.278)
cwb-nc> chk SS can_tick
Invoking alternation-free model checker.
Building automaton...
........
States: 899
Transitions: 2567
Done building automaton.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(1.644,0.046,0.188,1.706)
cwb-nc> chk SS failures_possible
Invoking alternation-free model checker.
Building automaton...
........
States: 899
Transitions: 2567
Done building automaton.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(1.137,0.014,0.000,1.163)
cwb-nc> chk SS no_false_alarms
Invoking alternation-free model checker.
Building automaton...
........
States: 899
Transitions: 2567
Done building automaton.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(1.215,0.018,0.015,1.243)
cwb-nc> chk SS eventually_silent
Invoking L2 model checker.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(11.326,0.266,1.453,12.133)
cwb-nc> 
cwb-nc> 