Executing CWB script file cws/ftolerant.1.cws, directing output to cws/results/ftolerant.1.out.
July 20, 1996   13:32
Execution time (user,system,gc,real):(0.010,0.000,0.000,0.071)
cwb-nc> load ftolerant.pccs
Execution time (user,system,gc,real):(0.150,0.030,0.010,0.175)
cwb-nc> 
cwb-nc> load formulas/failures_responded.mu
Execution time (user,system,gc,real):(0.020,0.000,0.000,0.018)
cwb-nc> load formulas/failures_responded_again.mu
Execution time (user,system,gc,real):(0.020,0.000,0.000,0.016)
cwb-nc> load formulas/can_tick.mu
Execution time (user,system,gc,real):(0.010,0.000,0.000,0.005)
cwb-nc> load formulas/failures_possible.mu
Execution time (user,system,gc,real):(0.010,0.000,0.000,0.005)
cwb-nc> load formulas/failures_possible_again.mu
Execution time (user,system,gc,real):(0.000,0.010,0.000,0.011)
cwb-nc> load formulas/no_false_alarms.mu
Execution time (user,system,gc,real):(0.010,0.000,0.000,0.007)
cwb-nc> load formulas/no_false_alarms_again.mu
Execution time (user,system,gc,real):(0.000,0.010,0.000,0.013)
cwb-nc> load formulas/eventually_silent.mu
Execution time (user,system,gc,real):(0.020,0.000,0.000,0.018)
cwb-nc> load formulas/react_on_repair.mu
Execution time (user,system,gc,real):(0.010,0.000,0.000,0.012)
cwb-nc> 
cwb-nc> chk SS failures_responded
Invoking L2 model checker.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(12.690,0.440,1.100,13.123)
cwb-nc> chk SS failures_responded_again
Invoking L2 model checker.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(727.910,36.380,109.030,764.383)
cwb-nc> chk SS can_tick
Invoking alternation-free model checker.
Building automaton...
.........1000.........2000.........3000.........4000.........5000
.........6000.........7000.........8000.........9000.........10000
.........11000.........
States: 11905
Transitions: 33760
Done building automaton.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(61.090,4.150,9.620,65.240)
cwb-nc> chk SS failures_possible
Invoking alternation-free model checker.
Building automaton...
.........1000.........2000.........3000.........4000.........5000
.........6000.........7000.........8000.........9000.........10000
.........11000.........
States: 11905
Transitions: 33760
Done building automaton.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(51.480,3.430,8.260,54.950)
cwb-nc> chk SS failures_possible_again
Invoking alternation-free model checker.
Building automaton...
.........1000.........2000.........3000.........4000.........5000
.........6000.........7000.........8000.........9000.........10000
.........11000.........
States: 11905
Transitions: 33760
Done building automaton.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(46.320,0.940,2.390,47.264)
cwb-nc> chk SS no_false_alarms
Invoking alternation-free model checker.
Building automaton...
.........1000.........2000.........3000.........4000.........5000
.........6000.........7000.........8000.........9000.........10000
.........11000.........
States: 11905
Transitions: 33760
Done building automaton.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(46.480,0.880,2.290,47.380)
cwb-nc> chk SS no_false_alarms_again
Invoking alternation-free model checker.
Building automaton...
.........1000.........2000.........3000.........4000.........5000
.........6000.........7000.........8000.........9000.........10000
.........11000.........
States: 11905
Transitions: 33760
Done building automaton.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(50.820,3.490,7.260,54.310)
cwb-nc> chk SS eventually_silent
Invoking L2 model checker.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(391.880,24.170,64.520,416.109)
cwb-nc> chk SS react_on_repair
Invoking L2 model checker.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(758.470,33.680,106.340,792.266)
cwb-nc> 
cwb-nc> 
cwb-nc> 
cwb-nc> 
cwb-nc> 
cwb-nc> 