Executing CWB script file cws/ftolerant.2.cws, directing output to cws/results/ftolerant.2.out.
July 20, 1996   14:10
Execution time (user,system,gc,real):(0.000,0.010,0.000,0.049)
cwb-nc> load ftolerant.pccs
Execution time (user,system,gc,real):(0.130,0.040,0.000,0.173)
cwb-nc> 
cwb-nc> load formulas/failures_responded.mu
Execution time (user,system,gc,real):(0.010,0.000,0.000,0.016)
cwb-nc> load formulas/failures_responded_again.mu
Execution time (user,system,gc,real):(0.010,0.000,0.000,0.015)
cwb-nc> load formulas/can_tick.mu
Execution time (user,system,gc,real):(0.000,0.010,0.000,0.005)
cwb-nc> load formulas/failures_possible.mu
Execution time (user,system,gc,real):(0.010,0.000,0.000,0.005)
cwb-nc> load formulas/failures_possible_again.mu
Execution time (user,system,gc,real):(0.010,0.000,0.000,0.010)
cwb-nc> load formulas/no_false_alarms.mu
Execution time (user,system,gc,real):(0.010,0.000,0.000,0.007)
cwb-nc> load formulas/no_false_alarms_again.mu
Execution time (user,system,gc,real):(0.020,0.000,0.000,0.012)
cwb-nc> load formulas/eventually_silent.mu
Execution time (user,system,gc,real):(0.020,0.000,0.000,0.016)
cwb-nc> load formulas/react_on_repair.mu
Execution time (user,system,gc,real):(0.010,0.000,0.000,0.011)
cwb-nc> 
cwb-nc> min -S bisim SS SS-min
Building automaton...
.........1000.........2000.........3000.........4000.........5000
.........6000.........7000.........8000.........9000.........10000
.........11000.........
States: 11905
Transitions: 33760
Done building automaton.
Minimizing automaton...
Computing bisimulation...
Done computing bisimulation.
Done minimizing automaton.
Execution time (user,system,gc,real):(262.390,10.580,30.250,272.998)
cwb-nc> 
cwb-nc> chk SS-min failures_responded
Invoking L2 model checker.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(6.160,1.560,4.110,7.712)
cwb-nc> chk SS-min failures_responded_again
Invoking L2 model checker.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(150.590,15.500,43.350,166.112)
cwb-nc> chk SS-min can_tick
Invoking alternation-free model checker.
Building automaton...
.........1000.........2000.........3000.........4000.........5000
.........6000.........7000....
States: 7485
Transitions: 26164
Done building automaton.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(12.590,0.580,1.890,13.172)
cwb-nc> chk SS-min failures_possible
Invoking alternation-free model checker.
Building automaton...
.........1000.........2000.........3000.........4000.........5000
.........6000.........7000....
States: 7485
Transitions: 26164
Done building automaton.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(17.740,3.020,7.080,20.765)
cwb-nc> chk SS-min failures_possible_again
Invoking alternation-free model checker.
Building automaton...
.........1000.........2000.........3000.........4000.........5000
.........6000.........7000....
States: 7485
Transitions: 26164
Done building automaton.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(12.370,0.460,1.400,12.824)
cwb-nc> chk SS-min no_false_alarms
Invoking alternation-free model checker.
Building automaton...
.........1000.........2000.........3000.........4000.........5000
.........6000.........7000....
States: 7485
Transitions: 26164
Done building automaton.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(11.580,0.410,1.270,12.016)
cwb-nc> chk SS-min no_false_alarms_again
Invoking alternation-free model checker.
Building automaton...
.........1000.........2000.........3000.........4000.........5000
.........6000.........7000....
States: 7485
Transitions: 26164
Done building automaton.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(16.150,2.620,5.740,18.768)
cwb-nc> chk SS-min eventually_silent
Invoking L2 model checker.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(119.350,12.390,33.320,131.758)
cwb-nc> chk SS-min react_on_repair
Invoking L2 model checker.
TRUE, the agent satisfies the formula.
Execution time (user,system,gc,real):(222.940,21.740,58.870,244.732)
cwb-nc> 
cwb-nc> 
cwb-nc> 
cwb-nc> 
cwb-nc> 
cwb-nc> 